# NoConstraintsToLinks Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..NoConstraintsToLinks Property
BuiltInFailures..::..DimensionFailures Class See Also
---
Constraints may not be created to linked instances using Shared Locations.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoConstraintsToLinks { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoConstraintsToLinks As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoConstraintsToLinks {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace